codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg124.h
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEJ0:1;
    unsigned CNIEJ1:1;
    unsigned CNIEJ2:1;
    unsigned :1;
    unsigned CNIEJ4:1;
    unsigned :3;
    unsigned CNIEJ8:1;
    unsigned CNIEJ9:1;
    unsigned :1;
    unsigned CNIEJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATJ0:1;
    unsigned CNSTATJ1:1;
    unsigned CNSTATJ2:1;
    unsigned CNSTATJ3:1;
    unsigned :1;
    unsigned CNSTATJ5:1;
    unsigned :3;
    unsigned CNSTATJ9:1;
    unsigned :1;
    unsigned CNSTATJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEJ __attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEJ0:1;
  unsigned CNNEJ1:1;
  unsigned CNNEJ2:1;
  unsigned :1;
  unsigned CNNEJ4:1;
  unsigned :3;
  unsigned CNNEJ8:1;
  unsigned CNNEJ9:1;
  unsigned :1;
  unsigned CNNEJ11:1;
} __CNNEJbits_t;
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFJ __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFJ0:1;
  unsigned CNFJ1:1;
  unsigned CNFJ2:1;
  unsigned :1;
  unsigned CNFJ4:1;
  unsigned :3;
  unsigned CNFJ8:1;
  unsigned CNFJ9:1;
  unsigned :1;
  unsigned CNFJ11:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned BUFCDEC:1;
    unsigned :3;
    unsigned MANFC:1;
    unsigned :2;
    unsigned AUTOFC:1;
    unsigned RXEN:1;
    unsigned TXRTS:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned PTV:16;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned RXBUF_SZ:7;
  };
  struct {
    unsigned w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHCON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXST __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned TXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTSET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHTXSTINV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXST __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :2;
    unsigned RXSTADDR:30;
  };
  struct {
    unsigned w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTSET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHRXSTINV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTLOWER:32;
  };
} __ETHHT0bits_t;
extern volatile __ETHHT0bits_t ETHHT0bits __asm__ ("ETHHT0") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT0INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned HTUPPER:32;
  };
} __ETHHT1bits_t;
extern volatile __ETHHT1bits_t ETHHT1bits __asm__ ("ETHHT1") __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1SET __attribute__((section("sfrs")));
extern volatile unsigned int        ETHHT1INV __attribute__((section("sfrs")));
extern volatile unsigned int        ETHPMM0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned w:32;
  };
  struct {
    unsigned PMMLOWER:32;
  };
} __ETHPMM0bits_t;
