codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efg124.h
#define _OFF096_VOFF_POSITION                    0x00000001
#define _OFF096_VOFF_MASK                        0x0003FFFE
#define _OFF096_VOFF_LENGTH                      0x00000011

#define _OFF097_VOFF_POSITION                    0x00000001
#define _OFF097_VOFF_MASK                        0x0003FFFE
#define _OFF097_VOFF_LENGTH                      0x00000011

#define _OFF098_VOFF_POSITION                    0x00000001
#define _OFF098_VOFF_MASK                        0x0003FFFE
#define _OFF098_VOFF_LENGTH                      0x00000011

#define _OFF099_VOFF_POSITION                    0x00000001
#define _OFF099_VOFF_MASK                        0x0003FFFE
#define _OFF099_VOFF_LENGTH                      0x00000011

#define _OFF100_VOFF_POSITION                    0x00000001
#define _OFF100_VOFF_MASK                        0x0003FFFE
#define _OFF100_VOFF_LENGTH                      0x00000011

#define _OFF101_VOFF_POSITION                    0x00000001
#define _OFF101_VOFF_MASK                        0x0003FFFE
#define _OFF101_VOFF_LENGTH                      0x00000011

#define _OFF102_VOFF_POSITION                    0x00000001
#define _OFF102_VOFF_MASK                        0x0003FFFE
#define _OFF102_VOFF_LENGTH                      0x00000011

#define _OFF103_VOFF_POSITION                    0x00000001
#define _OFF103_VOFF_MASK                        0x0003FFFE
#define _OFF103_VOFF_LENGTH                      0x00000011

#define _OFF104_VOFF_POSITION                    0x00000001
#define _OFF104_VOFF_MASK                        0x0003FFFE
#define _OFF104_VOFF_LENGTH                      0x00000011

#define _OFF105_VOFF_POSITION                    0x00000001
#define _OFF105_VOFF_MASK                        0x0003FFFE
#define _OFF105_VOFF_LENGTH                      0x00000011

#define _OFF106_VOFF_POSITION                    0x00000001
#define _OFF106_VOFF_MASK                        0x0003FFFE
#define _OFF106_VOFF_LENGTH                      0x00000011

#define _OFF109_VOFF_POSITION                    0x00000001
#define _OFF109_VOFF_MASK                        0x0003FFFE
#define _OFF109_VOFF_LENGTH                      0x00000011

#define _OFF110_VOFF_POSITION                    0x00000001
#define _OFF110_VOFF_MASK                        0x0003FFFE
#define _OFF110_VOFF_LENGTH                      0x00000011

#define _OFF111_VOFF_POSITION                    0x00000001
#define _OFF111_VOFF_MASK                        0x0003FFFE
#define _OFF111_VOFF_LENGTH                      0x00000011

#define _OFF112_VOFF_POSITION                    0x00000001
#define _OFF112_VOFF_MASK                        0x0003FFFE
#define _OFF112_VOFF_LENGTH                      0x00000011

#define _OFF113_VOFF_POSITION                    0x00000001
#define _OFF113_VOFF_MASK                        0x0003FFFE
#define _OFF113_VOFF_LENGTH                      0x00000011

#define _OFF114_VOFF_POSITION                    0x00000001
#define _OFF114_VOFF_MASK                        0x0003FFFE
#define _OFF114_VOFF_LENGTH                      0x00000011

#define _OFF115_VOFF_POSITION                    0x00000001
#define _OFF115_VOFF_MASK                        0x0003FFFE
#define _OFF115_VOFF_LENGTH                      0x00000011

#define _OFF116_VOFF_POSITION                    0x00000001
#define _OFF116_VOFF_MASK                        0x0003FFFE
#define _OFF116_VOFF_LENGTH                      0x00000011

#define _OFF117_VOFF_POSITION                    0x00000001
#define _OFF117_VOFF_MASK                        0x0003FFFE
#define _OFF117_VOFF_LENGTH                      0x00000011

#define _OFF118_VOFF_POSITION                    0x00000001
#define _OFF118_VOFF_MASK                        0x0003FFFE
#define _OFF118_VOFF_LENGTH                      0x00000011

#define _OFF119_VOFF_POSITION                    0x00000001
#define _OFF119_VOFF_MASK                        0x0003FFFE
#define _OFF119_VOFF_LENGTH                      0x00000011

#define _OFF120_VOFF_POSITION                    0x00000001
#define _OFF120_VOFF_MASK                        0x0003FFFE
#define _OFF120_VOFF_LENGTH                      0x00000011

#define _OFF121_VOFF_POSITION                    0x00000001
#define _OFF121_VOFF_MASK                        0x0003FFFE
#define _OFF121_VOFF_LENGTH                      0x00000011

#define _OFF122_VOFF_POSITION                    0x00000001
#define _OFF122_VOFF_MASK                        0x0003FFFE
#define _OFF122_VOFF_LENGTH                      0x00000011

#define _OFF123_VOFF_POSITION                    0x00000001
#define _OFF123_VOFF_MASK                        0x0003FFFE
#define _OFF123_VOFF_LENGTH                      0x00000011

#define _OFF124_VOFF_POSITION                    0x00000001
#define _OFF124_VOFF_MASK                        0x0003FFFE
#define _OFF124_VOFF_LENGTH                      0x00000011

#define _OFF125_VOFF_POSITION                    0x00000001
#define _OFF125_VOFF_MASK                        0x0003FFFE
#define _OFF125_VOFF_LENGTH                      0x00000011

#define _OFF126_VOFF_POSITION                    0x00000001
#define _OFF126_VOFF_MASK                        0x0003FFFE
#define _OFF126_VOFF_LENGTH                      0x00000011

#define _OFF127_VOFF_POSITION                    0x00000001
#define _OFF127_VOFF_MASK                        0x0003FFFE
#define _OFF127_VOFF_LENGTH                      0x00000011

#define _OFF128_VOFF_POSITION                    0x00000001
#define _OFF128_VOFF_MASK                        0x0003FFFE
#define _OFF128_VOFF_LENGTH                      0x00000011

#define _OFF129_VOFF_POSITION                    0x00000001
#define _OFF129_VOFF_MASK                        0x0003FFFE
#define _OFF129_VOFF_LENGTH                      0x00000011

#define _OFF130_VOFF_POSITION                    0x00000001
#define _OFF130_VOFF_MASK                        0x0003FFFE
#define _OFF130_VOFF_LENGTH                      0x00000011

#define _OFF131_VOFF_POSITION                    0x00000001
#define _OFF131_VOFF_MASK                        0x0003FFFE
#define _OFF131_VOFF_LENGTH                      0x00000011

#define _OFF132_VOFF_POSITION                    0x00000001
#define _OFF132_VOFF_MASK                        0x0003FFFE
#define _OFF132_VOFF_LENGTH                      0x00000011

#define _OFF133_VOFF_POSITION                    0x00000001
#define _OFF133_VOFF_MASK                        0x0003FFFE
#define _OFF133_VOFF_LENGTH                      0x00000011

